<template>
  <view :class="styles.myContainer">
    <navbar title="我的">
      <template #left>
        <view style="padding: 6px 20px" @tap="goHomePage">
          <IconFont name="home" size="20" />
        </view>
      </template>
    </navbar>
    <nut-watermark :gap-x="20" font-color="rgba(0, 0, 0, .1)" :z-index="1" content="我的" />

    <nut-cell class="infoContent" @tap="editInfo">
      <image src="../img/logo1.jpg" mode="heightFix" />
      <view class="info">
        {{ changeLongStr(pageData.userInfo.nickName, 8) }}
      </view>
      <view class="edit">
        修改信息
        <image src="../img/arrow.png" />
      </view>
    </nut-cell>
    <view class="order">
      <view class="title">
        <view class="txt"> 我的订单 </view>
        <view class="all" @tap="torOrder(0)">
          全部订单
          <image src="../img/arrow.png" />
        </view>
      </view>
      <view class="myTab">
        <nut-tabbar @tab-switch="tabSwitch">
          <nut-tabbar-item tab-title="待支付">
            <template #icon>
              <alIconfont name="icon-a-daifukuan2x" size="30" fill="#000" />
            </template>
          </nut-tabbar-item>
          <nut-tabbar-item tab-title="已支付">
            <template #icon>
              <alIconfont name="icon-a-daifahuo2x" size="30" fill="#000" />
            </template>
          </nut-tabbar-item>
          <nut-tabbar-item tab-title="已取消">
            <template #icon>
              <alIconfont name="icon-a-yiquxiao2x" size="30" fill="#000" />
            </template>
          </nut-tabbar-item>
        </nut-tabbar>
      </view>
    </view>

    <view class="otherMod">
      <button class="ModItem button-to-view" open-type="contact">
        <image src="../img/MLADJHEL-1666324258493contact.png" class="icon lxkfIcon" />
        <view class="center"> 客服 </view>
        <alIconfont name="icon-jiantou" size="15" fill="#999999" class="right" />
      </button>
      <view class="ModItem" @tap="toMine">
        <image src="../img/MLADJHEL-1666324258493contact.png" class="icon lxkfIcon" />
        <view class="center"> 线下票绑定 </view>
        <alIconfont name="icon-jiantou" size="15" fill="#999999" class="right" />
      </view>
      <view class="ModItem" @tap="toVistor">
        <image src="../img/MLADJHEL-1666324258493contact.png" class="icon lxkfIcon" />
        <view class="center"> 游客照片 </view>
        <alIconfont name="icon-jiantou" size="15" fill="#999999" class="right" />
      </view>
      <view class="ModItem">
        <image src="../img/MLADJHEL-1666324258493contact.png" class="icon lxkfIcon" />
        <view class="center"> 关于我们 </view>
        <alIconfont name="icon-jiantou" size="15" fill="#999999" class="right" />
      </view>
      <view class="ModItem" @tap="pageData.explanationShow = true">
        <image src="../img/MLADJHEL-1666324258493contact.png" class="icon lxkfIcon" />
        <view class="center"> 隐私协议 </view>
        <alIconfont name="icon-jiantou" size="15" fill="#999999" class="right" />
      </view>
    </view>
    <nut-popup
      v-model:visible="pageData.explanationShow"
      position="bottom"
      round
      close-on-click-overlay
      pop-class="explanationPop"
      @click-overlay="handleCloseExplanationPop"
    >
      <view class="explanation">
        <view class="head">
          <view class="headText"> 隐私协议 </view>
          <view class="close" @tap="handleCloseExplanationPop"> + </view>
        </view>

        <view class="content">
          <view class="title">隐私政策（摘要）</view>
          <view class="paragraph">
            最近更新及生效日期：2024年10月21日。
            我们非常重视您的隐私和个人信息保护，您在使用旅拍通微信小程序（以下简称“旅拍通”）时，我们可能会收集和使用您的相关信息，请您再开始使用前，仔细阅读、充分理解并同意接受本隐私政策的全部内容，特别是我们以粗体标识的条款。
            本隐私政策的摘要主要向您说明：我们在必要范围内收集和使用您的个人信息类型和业务场景，以及我们处理您个人信息的基本规则。如果您想了解我们可能收集和使用您个人信息的全部场景，已经我们处理您个人信息的全部规则，请您查阅附文中的《隐私政策》全文。
            一、我们如何收集和使用您的个人信息 1、会员注册。为完成创建账号，您需提供以下信息：您的手机号码（用于实名认证）、创建的用户名和密码、上传头像。
            2、产品内购。当您购买旅拍通的付费服务（包括专业版相册）后，我们会收集相应的订单信息，内容包括下单时间、购买金额、购买次数以及登陆/购买的用户名和手机号码。
            3、拍照功能。当您在旅拍通里使用手机拍照时，您需要开通下列终端系统权限： 存储权限，用于读取和存储手机本地的照片。
            4、个人名片。若您选择使用旅拍通的个人名片展示功能，我们需要收集您填写的手机号码和微信号，并且一旦您选择使用个人名片展示功能，您填写的手机号码和微信号将在旅拍通上公开展示，其他用户可通过该信息联系您。若您不提供以上信息，您也可以完成个人名片展示，但不会展示您的手机号码和微信号联系方式，也不影响您使用其它基础功能。
            二、我们如何共享您的个人信息
            请您理解，我们无法单独向您提供全部的服务，需要其他服务提供商为您一起提供服务，因此，我们需要向必要的第三方共享或委托处理的方式提供您的部分个人信息。您可以通过《个人信息第三方共享清单》查看第三方SDK手机和使用您个人信息的情况。
            三、您如何管理您的个人信息
            您可以通过多种方式管理您的个人信息，例如访问、更正您的个人资料，以及注销您的账户。但也请您理解，我们可能会因为履行法律规定义务的原因无法完全满足您的请求。
            以下为旅拍通的《隐私政策》全文。 隐私政策 本政策将帮助您了解在使用旅拍通的过程中可能涉及的以下内容： 1、我们如何收集和使用您的个人信息
            2、我们如何使用 Cookie 和同类技术 3、我们如何共享、转让、公开披露您的个人信息 4、我们如何保护您的个人信息 5、您的权利 6、我们如何处理儿童的个人信息
            7、个人信息的存储 8、适用法律及管辖 9、本政策如何更新 10、如何联系我们
            旅拍通深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，旅拍通承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
            请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私政策》。 一、我们如何收集和使用您的个人信息
            个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
            旅拍通仅会出于本政策所述的以下目的，收集和使用您的个人信息： （一）业务功能一：注册成为用户
            为完成创建账号，您需提供以下信息：您的手机号码（用于实名认证）、创建的用户名和密码、上传头像。
            由于本服务是有偿的，若您不注册，将无法使用本服务和产品。
            在注册过程中，您可以选择告知我们您所在城市、职业、了解到我们的渠道，但如果您不提供这些信息，将不会影响使用本服务的基本功能。
            （二）业务功能二：产品内购
            当您购买旅拍通的付费服务（包括专业版相册）后，我们会收集相应的订单信息，内容包括下单时间、购买金额、购买次数以及登陆/购买的用户名和手机号码
            （三）业务功能三：创建相册 当您创建相册时，我们需要收集您的相册名称和用户名，以此确认您的相册信息。 （四）业务功能四：拍照功能
            1、当您使用相机拍照时，需要将手机与相机进行连接，为了向您提供相应的连接提示和设置方法，我们需要收集您的摄影设备的信息，包括相机品牌、型号和序列号。如果您拒绝进行连接，将无法连接相机和手机，进而无法使用相机拍照并无法使用照片直播功能，但不影响使用手机进行拍照和直播。
            2、当您在旅拍通里使用手机拍照时，您需要开通下列终端系统权限： 存储权限，用于读取和存储手机本地的照片。 （五）业务功能九：个人名片展示
            您可以选择是否使用旅拍通的个人名片展示功能，一旦您选择使用，我们需要收集您填写的手机号码和微信号，并且一旦您选择使用个人名片展示功能，您填写的手机号码和微信号将在旅拍通上公开展示，其他用户可通过该信息联系您。若您不提供以上信息，您也可以完成个人名片展示，但不会展示您的手机号码和微信号联系方式，也不影响您使用其它基础功能。
            （六）向您提供其他相关产品功能和/或服务
            1、客户服务。当您向我们提起投诉、进行咨询或申诉时，为了方便与您联系或帮助您解决问题，我们可能需要您提供姓名、手机号码、微信号、电子邮件，方便为您反馈处理结果。
            如您拒绝提供上述信息，我们可能无法向您及时反馈相关处理结果。
            2、附加服务。接收产品、服务、营销或调查问卷信息。为更好地让您了解旅拍通的产品和相关服务，我们将会向您的手机推送我们的产品、服务、营销信息或向您进行相关的问卷调查。但如果您不想接收我们给您发送的此类信息，您可通过短信提示回复“TD”进行退订。
            （七）以下为征得个人信息主体授权同意的例外情形: 1、与个人信息控制者履行法律法规规定的义务相关的; 2、与国家安全、国防安全直接相关的;
            3、与公共安全、公共卫生、重大公共利益直接相关的; 4、与刑事侦查、起诉、审判和判决执行等直接相关的;
            5、出于维护个人信息主体或其他个人的生命、财产等重大合法权 益但又很难得到本人授权同意的; 6、所涉及的个人信息是个人信息主体自行向社会公众公开的;
            7、根据个人信息主体要求签订和履行合同所必需的; 二、我们如何使用 Cookie 和同类技术 （一）Cookie
            为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于
            Cookie，网站能够存储您的偏好数据。 我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。有关详情，请参见
            AboutCookies.org。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止Cookie的功能，您可以通过浏览器设置选项清除计算机上保存的所有Cookie
            （二）网站信标和像素标签 除 Cookie
            外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击
            URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
            （三）Do Not Track（请勿追踪） 很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track
            请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not
            Track，那么我们的所有网站都会尊重您的选择。 三、我们如何共享、转让、公开披露您的个人信息 （一）共享
            我们不会与浙江戴香居文旅产业有限公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
            1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
            2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
            3、在法律要求或允许的范围内，为了保护旅拍通及其用户或社会公众利益、财产或安全免遭损害而有必要提供您的个人信息给第三方。
            4、与我们的关联公司共享：您的个人信息可能会与成都旅拍通科技有限公司的关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。
            5、与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以保障为您提供的服务得以完成，并为您提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。
            目前，我们的授权合作伙伴包括以下三大类型：
            1）电商类供应商。当您使用旅拍通接入的电商平台即旅拍通定制服务时，我们可能将您的订单信息等交易有关的必要信息与第三方商家共享，如您的订单内容、用户名及联系方式、收货地址，以实现您向其购买商品或服务的需求，并促使其可以完成后续的售后服务。
            2）当您注册或使用手机号登录时，我们需要将您的手机号码共享给【短信推送平台】以向您提供【短信推送】服务。创蓝会给您发送短信验证码，当您收到短信验证码时，我们会自动读取您的该条短信息并将其中的验证码同步至我们注册或登录界面中，您可以直接点击验证码完成填写。我们不会读读取您的其他短信内容。
            3）技术支持类合作伙伴。为了完成相应的功能，我们会接入第三方的SDK来获得技术支持，比如帮助我们统计了解产品用户分布和数据分析，我们可能会向此类合作伙伴提供以下个人信息。旅拍通在不同时期可能会选择使用其中部分合作方或变更合作方，故清单内的合作伙伴可能会进行调整。
            第三方SDK名称 第三方公司名称 使用场景描述 使用目的 共享的个人信息类型 隐私政策 微信SDK 深圳市腾讯计算机系统有限公司 微信分享
            通过微信好友、微信朋友圈渠道分享相册 个人常用设备信息：MAC地址；Android ID 微信SDK隐私条款 微信支付 深圳市腾讯计算机系统有限公司 微信支付
            用户登录账户和支付过程中的安全风控 个人常用设备信息：MAC地址；Android ID 微信SDK隐私条款 （二）转让
            我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
            1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
            2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
            （三）公开披露 我们仅会在以下情况下，公开披露您的个人信息： 1、获得您明确同意后；
            2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。 （四）例外
            根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下收集、共享、转让或公开披露您的个人信息。
            1、与国家安全、国防安全等国家利益直接相关的； 2、与公共安全、公共卫生、公众知情等重大公共利益直接相关的；
            3、与犯罪侦查、起诉、审判和判决执行等直接相关的； 4、出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；
            5、根据您要求签订和履行合同所必需的； 6、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
            7、出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
            8、从合法公开披露的信息中收集到的个人信息的，如合法的新闻报道、政府信息公开等渠道； 9、法律法规规定的其他情形。 四、我们如何保护您的个人信息
            （一）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如信用卡信息）时受
            SSL 加密保护；我们对产品提供的配套Web服务提供HTTPS
            安全访问方式；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
            （二）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他旅拍通用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
            （三）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。
            （四）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
            同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。 五、您的权利
            按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利： （一）访问您的个人信息
            如果您希望访问或更正您的账户中的个人信息，您可以随时向我们提出申请，我们将在15日内完成您的请求，法律法规另有规定的除外。申请方式有以下两种：
            1、访问【旅拍通微信小程序】-【我的】-执行此类操作； 2、通过《隐私政策》文末提供的方式联系我们。 （二）删除您的个人信息
            1、一般而言，我们只会在法律法规规定或必需且最短的时间内保存您的个人信息。我们将在15日内对照片进行删除或匿名化处理,或者您可以联系我们删除这些照片。
            在以下情形中，您可以向我们提出删除个人信息的请求： （1）如果我们处理个人信息的行为违反法律法规； （2）如果我们处理个人信息的行为违 反了与您的约定；
            （3）法律法规等规定等其他情形。
            2、若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
            当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。 （三）个人信息主体注销账户
            您随时可注销此前注册的账户，您可以通过以下方式自行操作： 在【旅拍通】-【我的】-【更多】-【注销账号】中进行账号注销。
            在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，在15日内删除您的个人信息，法律法规另有规定的除外。 （四）个人信息主体获取个人信息副本
            如您需要您的个人信息的副本，您可以通过本《隐私政策》文末提供的方式联系我们，在核实您的身份后，我们将向您提供您在我们的服务中的个人信息副本（包括基本资料、账户信息），但法律法规另有规定的或本政策另有约定的除外。
            （五）约束信息系统自动决策
            在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。
            （六）响应您的上述请求
            1、为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在15日内做出答复。
            2、对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
            3、在以下情形中，按照法律法规要求，我们将无法响应您的请求： （1）与国家安全、国防安全直接相关的；
            （2）与公共安全、公共卫生、重大公共利益直接相关的； （3）与犯罪侦查、起诉、审判和判决执行等直接相关的；
            （4）与个人信息控制者履行法律法规规定的义务相关的； （4）有充分证据表明您存在主观恶意或滥用权利的；
            （5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。 （6）涉及商业秘密的。 六、个人信息的存储
            存储地点：我们会按照法律法规的规定，将在中华人民共和国境内收集的个人信息，存储在中华人民共和国境内。
            存储期限：我们承诺将使您的个人信息存储时间始终处于法律要求或实现产品功能和服务所需的必要且最短的期限内，例如，您的账号信息在您未进行撤回、删除或注销之前，我们会持续存储。对于超出期限的个人信息，我们会立即删除或做匿名化处理，但您行使删除权、注销账号或法律另有规定的除外。
            七、适用法律及管辖 本隐私政策适用中华人民共和国大陆地区法律。本隐私政策项下争议，由被告住所地法院管辖。 八、本政策如何更新
            （一）我们的隐私政策可能变更或修订。未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。
            对于重大变更，我们会以弹窗形式告知您并再次征得您的同意。 （二）本政策所指的重大变更包括但不限于：
            1、我们处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等； 2、您参与个人信息处理方面的权利及其行使方式发生重大变化；
            3、个人信息安全影响旅拍通报告表明存在风险时。
          </view>
        </view>
      </view>
    </nut-popup>
    <!-- toast提示 -->
    <my-toast-components ref="myToast" :duration="2500" />
  </view>
  <!-- tabbar -->
  <myTabBar></myTabBar>
</template>
<script lang="ts" setup>
import { Navbar } from '@fishui/taro-vue';
// @ts-ignore
import styles from './styles.scss';
import { reactive, ref } from 'vue';
definePageConfig({ backgroundColor: '#f3f3fe' });
import { getUserInfo } from '@/apis/lpt/mine';
import { changeLongStr } from '@/utils/index';
import Taro from '@tarojs/taro';
import myToastComponents from '@/components/myToast/index.vue';
import myTabBar from '../custom-tab-bar/index';
import { postBindOrder } from '@/apis/lpt/photographer';

const myToast = ref<any>();

const handleCloseExplanationPop = () => {
  pageData.explanationShow = false;
};
const toVistor = () => {
  Taro.navigateTo({ url: '/pages/template-mini/lpt/visitor/index' });
};

const tabSwitch = (_item: Record<string, unknown>, index: number) => {
  const itemIdMap = {
    0: 1,
    1: 2,
    2: 6,
  };
  torOrder(itemIdMap[index]);
};

const pageData = reactive({
  userInfo: {
    nickName: '',
    userMobile: '',
  },
  explanationShow: false,
});

const initPageData = async () => {
  const res = await getUserInfo();
  pageData.userInfo = res;
};

initPageData();

const editInfo = () => {
  Taro.navigateTo({ url: '/pages/template-mini/lpt/mine-edit/index' });
};
const torOrder = (id) => {
  myToast.value.myToastShow({
          icon: 'success',
          title: '演示模式，感谢关注',
          duration: 2000,
        });
  // Taro.navigateTo({ url: `/pages/template-mini/lpt/order/index?id=${id}` });
};

const goHomePage = () => {
  Taro.redirectTo({ url: '/pages/template-mini/menu/index' });
};

const toMine = () => {
  Taro.scanCode({
    success: async (scanCodeRes) => {
      // 扫码成功
      if (scanCodeRes.errMsg === 'scanCode:ok') {
        // 核销
        await postBindOrder(scanCodeRes.result);
        myToast.value.myToastShow({
          icon: 'success',
          title: '绑定成功',
          duration: 2000,
        });
        setTimeout(() => {
          // Taro.redirectTo({ url: '/pages/template-mini/lpt/order/index' });
          myToast.value.myToastShow({
          icon: 'success',
          title: '演示模式，感谢关注',
          duration: 2000,
        });
        }, 2000);
      } else {
        myToast.value.myToastShow({
          icon: 'error',
          title: '请扫描核销码',
          duration: 2000,
        });
      }
    },
  });
};
</script>
